IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/GPIO2_GPIO2.xml
	<register id="GPIO2_DIR23" acronym="GPIO2_DIR23" offset="0x38" width="32" description="">
		<bitfield id="DIR3" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 3 bits, 0 = output, 1 = input." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="DIR2" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 2 bits, 0 = output, 1 = input." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO2_OUT_DATA23" acronym="GPIO2_OUT_DATA23" offset="0x3C" width="32" description="">
		<bitfield id="OUT3" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 3 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="OUT2" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 2 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO2_SET_DATA23" acronym="GPIO2_SET_DATA23" offset="0x40" width="32" description="">
		<bitfield id="SET3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 3 bits. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SET2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 2 bits. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO2_CLR_DATA23" acronym="GPIO2_CLR_DATA23" offset="0x44" width="32" description="">
		<bitfield id="CLR3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLR2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO2_IN_DATA23" acronym="GPIO2_IN_DATA23" offset="0x48" width="32" description="">
		<bitfield id="IN3" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 3 bits." range="31 - 16" rwaccess="RO"/> 
		<bitfield id="IN2" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 2 bits." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="GPIO2_SET_RIS_TRIG23" acronym="GPIO2_SET_RIS_TRIG23" offset="0x4C" width="32" description="">
		<bitfield id="SETRIS3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 3 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SETRIS2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 2 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO2_CLR_RIS_TRIG23" acronym="GPIO2_CLR_RIS_TRIG23" offset="0x50" width="32" description="">
		<bitfield id="CLRRIS3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 3 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLRRIS2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 2 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO2_SET_FAL_TRIG23" acronym="GPIO2_SET_FAL_TRIG23" offset="0x54" width="32" description="">
		<bitfield id="SETFAL3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 3 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SETFAL2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 2 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO2_CLR_FAL_TRIG23" acronym="GPIO2_CLR_FAL_TRIG23" offset="0x58" width="32" description="">
		<bitfield id="CLRFAL3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 3 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLRFAL2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 2 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO2_INTSTAT23" acronym="GPIO2_INTSTAT23" offset="0x5C" width="32" description="">
		<bitfield id="STAT3" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 2 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="STAT2" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 2 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO2_DIR45" acronym="GPIO2_DIR45" offset="0x60" width="32" description="">
		<bitfield id="DIR5" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 5 bits, 0 = output, 1 = input." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="DIR4" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 4 bits, 0 = output, 1 = input." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO2_OUT_DATA45" acronym="GPIO2_OUT_DATA45" offset="0x64" width="32" description="">
		<bitfield id="OUT5" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 5 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="OUT4" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 4 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
